# Task 5.2
"""
Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000
Проверить работу скрипта на разных комбинациях сеть/маска.

Подсказка: Получить маску в двоичном формате можно так:

In [1]: "1" * 28 + "0" * 4
Out[1]: "11111111111111111111111111110000"
Ограничение: Все задания надо выполнять используя только пройденные темы.
"""

ip = input('Сестра, несите тазик. Тазик эвтаназик вида/24: ')
mask = int(ip[(ip.find('/') + 1):], 10)
mask_bin = '1' * mask + '0' * (32 - mask)
ip = ip[:ip.find('/')]
ip = list(ip.split('.'))
print(f'{ip[0]:<10}{ip[1]:<10}{ip[2]:<10}{ip[3]:<10}\n'
      f'{int(ip[0], 10):08b}  {int(ip[1], 10):08b}  {int(ip[2], 10):08b}  {int(ip[3], 10):08b}\n\n'
      f'/{mask}\n'
      f'{int(mask_bin[:8], 2):<10}{int(mask_bin[8:16], 2):<10}{int(mask_bin[16:24], 2):<10}{int(mask_bin[24:], 2):<10}\n'
      f'{mask_bin[:8]}  {mask_bin[8:16]}  {mask_bin[16:24]} {mask_bin[24:]}')
